misc/month12/TiDB/logs/sg2042_pioneer_revyos/sysbench.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.1710235524)

Running the test with following options:
Number of threads: 10
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 10 tps: 64.67 qps: 1332.23 (r/w/o: 939.26/260.01/132.96) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 10 tps: 73.17 qps: 1464.79 (r/w/o: 1024.41/293.70/146.68) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 10 tps: 71.66 qps: 1429.52 (r/w/o: 1000.23/285.97/143.32) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 10 tps: 71.06 qps: 1427.11 (r/w/o: 1001.78/281.89/143.44) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 10 tps: 73.65 qps: 1473.29 (r/w/o: 1031.07/294.93/147.30) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 10 tps: 74.01 qps: 1476.47 (r/w/o: 1033.76/294.69/148.01) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 10 tps: 73.34 qps: 1462.70 (r/w/o: 1022.03/294.01/146.67) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 10 tps: 70.63 qps: 1418.98 (r/w/o: 992.19/285.53/141.27) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 10 tps: 71.03 qps: 1425.17 (r/w/o: 1000.35/281.77/143.05) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 10 tps: 70.60 qps: 1405.91 (r/w/o: 983.00/281.05/141.86) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 10 tps: 70.34 qps: 1414.76 (r/w/o: 990.07/283.35/141.34) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 10 tps: 70.71 qps: 1403.50 (r/w/o: 980.92/280.83/141.74) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 10 tps: 69.10 qps: 1385.98 (r/w/o: 974.41/272.37/139.20) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 10 tps: 68.60 qps: 1377.76 (r/w/o: 960.80/279.08/137.88) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 10 tps: 70.69 qps: 1408.20 (r/w/o: 988.04/278.44/141.72) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 10 tps: 69.93 qps: 1399.70 (r/w/o: 978.76/281.07/139.87) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 10 tps: 69.71 qps: 1393.28 (r/w/o: 975.00/278.52/139.76) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 10 tps: 68.30 qps: 1356.66 (r/w/o: 947.86/272.20/136.60) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 10 tps: 71.41 qps: 1430.10 (r/w/o: 1003.34/283.62/143.14) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 10 tps: 70.30 qps: 1411.01 (r/w/o: 987.87/282.54/140.60) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            59500
        write:                           16978
        other:                           8522
        total:                           85000
    transactions:                        4250   (70.63 per sec.)
    queries:                             85000  (1412.67 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.1498s
    total number of events:              4250

Latency (ms):
         min:                                  108.30
         avg:                                  141.33
         max:                                  216.89
         95th percentile:                      155.80
         sum:                               600649.19

Threads fairness:
    events (avg/stddev):           425.0000/1.10
    execution time (avg/stddev):   60.0649/0.04