misc/month12/TiDB/logs/sg2042_pioneer_revyos/sysbench_64t.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.1710235524)

Running the test with following options:
Number of threads: 64
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 64 tps: 157.16 qps: 3384.71 (r/w/o: 2404.34/644.39/335.98) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 64 tps: 169.23 qps: 3391.94 (r/w/o: 2377.92/674.56/339.46) lat (ms,95%): 450.77 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 64 tps: 176.19 qps: 3501.24 (r/w/o: 2446.40/700.78/354.05) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 64 tps: 170.96 qps: 3409.96 (r/w/o: 2386.84/680.53/342.60) lat (ms,95%): 442.73 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 64 tps: 162.11 qps: 3253.50 (r/w/o: 2279.52/648.44/325.55) lat (ms,95%): 539.71 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 64 tps: 174.37 qps: 3521.72 (r/w/o: 2464.84/706.81/350.07) lat (ms,95%): 419.45 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 64 tps: 172.50 qps: 3407.39 (r/w/o: 2379.03/681.68/346.68) lat (ms,95%): 450.77 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 64 tps: 167.06 qps: 3380.91 (r/w/o: 2375.21/670.58/335.12) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 64 tps: 174.05 qps: 3462.03 (r/w/o: 2422.72/690.87/348.44) lat (ms,95%): 427.07 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 172.63 qps: 3454.23 (r/w/o: 2412.46/695.85/345.92) lat (ms,95%): 442.73 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 64 tps: 174.52 qps: 3479.74 (r/w/o: 2440.96/689.41/349.38) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 64 tps: 171.67 qps: 3433.04 (r/w/o: 2402.70/686.01/344.34) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 64 tps: 173.55 qps: 3453.95 (r/w/o: 2416.33/689.52/348.09) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 64 tps: 174.25 qps: 3508.04 (r/w/o: 2453.86/705.67/348.50) lat (ms,95%): 442.73 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 64 tps: 172.35 qps: 3459.96 (r/w/o: 2425.54/688.73/345.70) lat (ms,95%): 442.73 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 64 tps: 178.54 qps: 3544.41 (r/w/o: 2480.52/705.48/358.41) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 64 tps: 166.99 qps: 3332.88 (r/w/o: 2333.92/663.64/335.32) lat (ms,95%): 475.79 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 64 tps: 174.71 qps: 3491.59 (r/w/o: 2439.65/701.18/350.76) lat (ms,95%): 427.07 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 64 tps: 168.68 qps: 3387.31 (r/w/o: 2371.22/676.73/339.36) lat (ms,95%): 450.77 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 175.27 qps: 3503.36 (r/w/o: 2453.75/697.41/352.20) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            144886
        write:                           41332
        other:                           20762
        total:                           206980
    transactions:                        10349  (171.50 per sec.)
    queries:                             206980 (3430.03 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.3230s
    total number of events:              10349

Latency (ms):
         min:                                  240.27
         avg:                                  372.11
         max:                                  607.57
         95th percentile:                      442.73
         sum:                              3850980.52

Threads fairness:
    events (avg/stddev):           161.7031/1.41
    execution time (avg/stddev):   60.1716/0.08